
[
    {
        "title": "My First Blog Post.",
        "description": " Welcome to my first ever blog post! I'm not sure what I'll be talking about but here's a little blurb of whatever I'm thinking about right now! Enjoy!",
        "author": "Richard Cui",
        "date": "09/08/2024",
        "photo": "/photos/blogs/1-wingsforlife.jpg",
        "alt": "Photo of Richard Cui under Red Bull baloon arch",
        "content": [
            "Hello! I'm trying to write some stuff for my blog. Currently it's September 8th, 2024, 6:42pm EST. I have to run 16k soon and I'm not too excited about that. I know I'll be able to do it but it's still that mental block of: \"Do I want to?\". Well 100% I don't have to. So why do I want to run 16k nevertheless a marathon...<br /><br />",
            "Well in all fairness, I've already talked the talk. I remember watching this Instagram reel where some guy talked about that happy feeling of telling everyone you're running a marathon. You feel like a superstar and everyone is so proud of you. But now you're here and you actually have to do it, way different story. You don't want to let anyone down now. People are rooting for you and now it's more than just about you. That's one of the reasons why I run: because I don't want to let anybody down.<br /><br />",
            "Another reason is because if I don't, I'll feel like shit. That's life isn't it. I find that the more I cave into my comforting instincts of \"do it next time\" or \"5 more minutes\", the shittier I feel. Then the shittier I feel, the more I want to treat myself with \"5 more minutes\" that poisoned me in the first place. I need to break that cycle and go eat shit. At least I'm tired but proud of myself at the end of my run. I remember someone saying: \"movement is medicine\" and I could not agree with it any more than I already do. Walks, runs, going to the gym, playing some catch on the field, this is peak happiness and all you need is yourself (maybe someone else if you're playing catch). Running makes me feel happy, even if it doesn't initially.<br /><br />",
            "Last reason before I actually start figuring out how to actually code this blog to life, it's because it gives my life purpose. Why not run a marathon? I'm working to something that's hard to achieve, but it is achievable. Quite a lot of people run marathons, why not me? Majority of people haven't ran a marathon, yet they all had the potential to run one at some point in their lives. I don't want to fit in that group. I want to work on something that majority of people have never achieved. On top of balancing my daily life responsabilities, I could say that I balanced 3 jobs and trained for a marathon during the fall of 2024. Let's fucking go.<br /><br />",
            "Well that's it for my first blog post. It didn't mean to be so long; it actually was going to be a \"loren ipsum\" type of blog before I decided it was my break activity. I'm super excited to have a blog cooking up. I love journaling and taking snapshots of moments in my life, whether through photos or writing. This is going to be a gamechanger and I can't wait to start.<br /><br />",
            "Until next time...<br /><br />",
            "Richard"
        ]
    },
    {
        "title": "My First Co-op Term.",
        "description": "A little insight into what co-op is like at Guelph + advice for people looking to get started with their co-op term.",
        "author": "Richard Cui",
        "date": "09/11/2024",
        "photo": "/photos/blogs/2-lincsmap.png",
        "alt": "A map of services the LINCS Project offers",
        "content": [
            "Well summer '24 has passed and we're here writing our first work term report ever. How exciting! I'm hoping that with this blog post, you all will take away a little more insight as to how applications actually work, what to expect on the job, and some first-timer wisdom along the read.<br /><br />",
            "A little bit about my role and where I worked. Over the summer, I was an undergraduate research assistant working for the LINCS Project here at Guelph. A little summary of what I did:",
            "<ul><li>I developed a dashboard using NextJS (Typescript) and NextUI/Tailwind</li><li>I built unit tests through Jest</li><li>I automated deployment workflows through Docker and GitLab CI/CD</li><li>I tackled LINCS ResearchSpace tickets, ranging from UI bugs to framework & SPARQL issues</li><li>Attended daily standup meetings with my manager discussing progress and issues</li><li>Attended weekly meetings with stakeholders and design teams</li></ul><br /><br />",
            "<h3>What is LINCS?</h3>The LINCS Project is a project to provide tools and infrasturcture to make humanities data more discoverable, searchable, and shareable. They do so by pushing the usage of Linked Open Data (LOD). With Linked Open Data, researchers are able to create a network of data to ensure reuseability, shareability, and searchability. Some of the tools and services they provide is ResearchSpace, SPARQL Endpoint, LINCS-API, etc. To help discover, review, and use LODs in various ways.<br /><br />",
            "<h3>Job Hunting</h3>I'd like to first emphasize that finding a co-op term is no joke. It's something you have to take seriously and thoughtfully. It's a discouraging and stressful process but it's a process we have to go through if we want to grow our skills. From my experience, this is how job hunting would be like. From the jump, I was hit with a lot of chatter surrounding your upcoming co-op term. LinkedIn updates, co-op conferences, people talking, it can all get very overwhelming. I was applying to roughly 3 jobs everyday and praying for the best. I'd go compare my resume to friends and colleagues and see how we could improve each others, I'd book appointments with our lovely experiential learning hub staff to review my resume contents and cover letters, and I'd try and get referalls through cold-messaging hiring managers through LinkedIn or Emailing. It wasn't the prettiest of processes, however, what you need to take away from this is that it'll get better. Although it's all sounding super discouraging, you need to understand that I'm now in a position where I could write about my first co-op job. It's unrealistic to think that this will be a breeze, so it's better set the expectations right and move forward from there. I'd also like to emphasize that co-op isn't your end-all be-all. There are plenty of different avenues one could take without having found a co-op term. At the end of the day, if you were a better than the person you were yesterday, than that's all that matters.<br /><br />",
            "<h3>My Goals at LINCS</h3>From the start, my manager and I developed 3 goals that I'd aim to achieve by the end of my work term:",
            "<ul><li>To learn how to use CI/CD Pipelines and Docker Images to automate workflow and create consistent development environments</li><li>To learn NextJS, NextUI, and Tailwind to create a responsive and accessible dashboard web application</li><li>To consistently work effective 7 hour days</li><br /><br />",
            "Through these 3 goals, I've developed the necessary skills to jumpstart my journey as a full-stack developer, I've also developed my self-assurance to project professionalism and confidence within the workplace, and I've also learned the neccesary skills to maintain boundaries within work to uphold a positive work-life balance. Of course it wasn't perfect from the start, but with time and discussions with my manager, I slowly picked up the skills needed to eventually achieve my goals consistently.<br /><br />",
            "The main technologies I've learnt were NextJS and TypeScript, React, NextUI themes and components, Tailwind utility classes, CSS modules and property usage, Docker containerization, and GitLab Auto DevOps CI/CD pipelines. With these skills, I was able to build this website using NextJS using the skills I freshly learned.<br /><br />",
            "Moreover, through my experience at LINCS I've learnt that I enjoy designing UIs and experimenting with how users react (UX) to my designs. This got me to also learn another technology, Figma, and some UI/UX design principles such as the rule of 4/8s, accessible design, basic principles of design (such as balance, proximity, color), etc.<br /><br />",
            "Building off of that, I've been able to develop some soft skills along my journey at LINCS. For one, I've defintely develop my ability to balace multiple tasks and responsabilities. Using scheduling tools and holding myself accountable, I've been able to keep track of current task progress and upcoming tasks, as well as giving myself the recognition that I'm completing these tasks and that I should feel proud of doing what I'm doing. Another skills has been developing my ability to maintain work-life balance. A work-hard play-hard motto was what I followed as I worked, where when it's 9-5, I'm focused on work, but never more and never less. This way I'm able to take the mental reset I'd need to keep myself fresh at work everyday, as well as simply doing the things I enjoy beyond work.<br /><br />",
            "<h3>My main project</h3>The main project I was handed was creating a dashboard to show key metrics that LINCS produces. It's meant to be a central hub of LINCS stats to show that the project is growing and progressing each and every day. Jumping into this, I didn't know what NextJS was and I've only heard of React. The closest thing that would have prepared me for this project was CIS*2750 where we learned JavaScript and how a full-stack application would be made. Anyways, I was given some resources to learn the framework and to start building the dashboard. I would begin with drawing out sketches of what I thought the dashboard should look like, as well as giving mock data to simulate API responses. I'd work with the UX team to improve user experience, and I'd work with stakeholders to discuss the actual contents of the dashboard. From there, I'd work with my manager to build the dashboard component by component, and eventually come to a fully working dashboard. Overall, it was a really rewarding experience - seeing something I've worked hard for coming to life - and I thoroughly enjoyed learning something new.<br /><br />",
            "<h3>Some shoutouts</h3>To sum up, I have nothing but gratitude and appreciation towards the folks at LINCS. They really took me in as their teammate as soon as I entered and I loved the culture they fostered. Although they're probably not reading this, I'd still like to give a big thanks to Pieter, Zach, Alliyya, Susan, and Amelia. Thank you Pieter, Zach, and Alliyya for being great mentors and providing wisdom as someone who's a professional in their field. My development over the summer is all because of them and I cannot thank them enough for it. Thank you Pieter for getting me started and guiding me through my first big project. Watching me learn NextJS and React from scratch must've made you cringe but you stuck by me a guided me to a successful end product. Thank you Susan for the wonderful opportunity. Our conversations have been nothing but delightful and I'm excited to see where the future of LINCS is headed. And thank you Amelia for being a great colleague and friend. Working with you made the job more exciting, and I grateful for your company.<br /><br />",
            "<h3>To wrap up</h3>Well that's my first work term finished. If this is the start, I'm excited to see where I go next."
        ]
    }
]
