[
  {
    "title": "My First Blog Post.",
    "description": " Welcome to my first ever blog post! I'm not sure what I'll be talking about but here's a little blurb of whatever I'm thinking about right now! Enjoy!",
    "author": "Richard Cui",
    "date": "09/08/2024",
    "photo": "/photos/blogs/1-wingsforlife.jpg",
    "alt": "Photo of Richard Cui under Red Bull baloon arch",
    "thumbnail": "/photos/blogs/4-3/1-wingsforlife.jpg",
    "banner": "/photos/blogs/16-9/1-wingsforlife.jpg",
    "content": [
      "Hello! I'm trying to write some stuff for my blog. Currently it's September 8th, 2024, 6:42pm EST. I have to run 16k soon and I'm not too excited about that. I know I'll be able to do it but it's still that mental block of: \"Do I want to?\". Well 100% I don't have to. So why do I want to run 16k nevertheless a marathon...<br /><br />",
      "Well in all fairness, I've already talked the talk. I remember watching this Instagram reel where some guy talked about that happy feeling of telling everyone you're running a marathon. You feel like a superstar and everyone is so proud of you. But now you're here and you actually have to do it, way different story. You don't want to let anyone down now. People are rooting for you and now it's more than just about you. That's one of the reasons why I run: because I don't want to let anybody down.<br /><br />",
      "Another reason is because if I don't, I'll feel like shit. That's life isn't it. I find that the more I cave into my comforting instincts of \"do it next time\" or \"5 more minutes\", the shittier I feel. Then the shittier I feel, the more I want to treat myself with \"5 more minutes\" that poisoned me in the first place. I need to break that cycle and go eat shit. At least I'm tired but proud of myself at the end of my run. I remember someone saying: \"movement is medicine\" and I could not agree with it any more than I already do. Walks, runs, going to the gym, playing some catch on the field, this is peak happiness and all you need is yourself (maybe someone else if you're playing catch). Running makes me feel happy, even if it doesn't initially.<br /><br />",
      "Last reason before I actually start figuring out how to actually code this blog to life, it's because it gives my life purpose. Why not run a marathon? I'm working to something that's hard to achieve, but it is achievable. Quite a lot of people run marathons, why not me? Majority of people haven't ran a marathon, yet they all had the potential to run one at some point in their lives. I don't want to fit in that group. I want to work on something that majority of people have never achieved. On top of balancing my daily life responsabilities, I could say that I balanced 3 jobs and trained for a marathon during the fall of 2024. Let's fucking go.<br /><br />",
      "Well that's it for my first blog post. It didn't mean to be so long; it actually was going to be a \"loren ipsum\" type of blog before I decided it was my break activity. I'm super excited to have a blog cooking up. I love journaling and taking snapshots of moments in my life, whether through photos or writing. This is going to be a gamechanger and I can't wait to start.<br /><br />",
      "Until next time...<br /><br />",
      "Richard"
    ]
  },
  {
    "title": "My First Co-op Term.",
    "description": "A little insight into what co-op is like at Guelph + advice for people looking to get started with their co-op term.",
    "author": "Richard Cui",
    "date": "09/11/2024",
    "photo": "/photos/blogs/2-lincsmap.png",
    "alt": "A map of services the LINCS Project offers",
    "thumbnail": "/photos/blogs/4-3/2-lincsmap.png",
    "banner": "/photos/blogs/16-9/2-lincsmap.png",
    "content": [
      "Well summer '24 has passed and we're here writing our first work term report ever. How exciting! I'm hoping that with this blog post, you all will take away a little more insight as to how applications actually work, what to expect on the job, and some first-timer wisdom along the read.<br /><br />",
      "A little bit about my role and where I worked. Over the summer, I was an undergraduate research assistant working for the LINCS Project here at Guelph. A little summary of what I did:",
      "<ul><li>I developed a dashboard using NextJS (Typescript) and NextUI/Tailwind</li><li>I built unit tests through Jest</li><li>I automated deployment workflows through Docker and GitLab CI/CD</li><li>I tackled LINCS ResearchSpace tickets, ranging from UI bugs to framework & SPARQL issues</li><li>Attended daily standup meetings with my manager discussing progress and issues</li><li>Attended weekly meetings with stakeholders and design teams</li></ul><br /><br />",
      "<h3>What is LINCS?</h3>The LINCS Project is a project to provide tools and infrasturcture to make humanities data more discoverable, searchable, and shareable. They do so by pushing the usage of Linked Open Data (LOD). With Linked Open Data, researchers are able to create a network of data to ensure reuseability, shareability, and searchability. Some of the tools and services they provide is ResearchSpace, SPARQL Endpoint, LINCS-API, etc. To help discover, review, and use LODs in various ways.<br /><br />",
      "<h3>Job Hunting</h3>I'd like to first emphasize that finding a co-op term is no joke. It's something you have to take seriously and thoughtfully. It's a discouraging and stressful process but it's a process we have to go through if we want to grow our skills. From my experience, this is how job hunting would be like. From the jump, I was hit with a lot of chatter surrounding your upcoming co-op term. LinkedIn updates, co-op conferences, people talking, it can all get very overwhelming. I was applying to roughly 3 jobs everyday and praying for the best. I'd go compare my resume to friends and colleagues and see how we could improve each others, I'd book appointments with our lovely experiential learning hub staff to review my resume contents and cover letters, and I'd try and get referalls through cold-messaging hiring managers through LinkedIn or Emailing. It wasn't the prettiest of processes, however, what you need to take away from this is that it'll get better. Although it's all sounding super discouraging, you need to understand that I'm now in a position where I could write about my first co-op job. It's unrealistic to think that this will be a breeze, so it's better set the expectations right and move forward from there. I'd also like to emphasize that co-op isn't your end-all be-all. There are plenty of different avenues one could take without having found a co-op term. At the end of the day, if you were a better than the person you were yesterday, than that's all that matters.<br /><br />",
      "<h3>My Goals at LINCS</h3>From the start, my manager and I developed 3 goals that I'd aim to achieve by the end of my work term:",
      "<ul><li>To learn how to use CI/CD Pipelines and Docker Images to automate workflow and create consistent development environments</li><li>To learn NextJS, NextUI, and Tailwind to create a responsive and accessible dashboard web application</li><li>To consistently work effective 7 hour days</li><br /><br />",
      "Through these 3 goals, I've developed the necessary skills to jumpstart my journey as a full-stack developer, I've also developed my self-assurance to project professionalism and confidence within the workplace, and I've also learned the neccesary skills to maintain boundaries within work to uphold a positive work-life balance. Of course it wasn't perfect from the start, but with time and discussions with my manager, I slowly picked up the skills needed to eventually achieve my goals consistently.<br /><br />",
      "The main technologies I've learnt were NextJS and TypeScript, React, NextUI themes and components, Tailwind utility classes, CSS modules and property usage, Docker containerization, and GitLab Auto DevOps CI/CD pipelines. With these skills, I was able to build this website using NextJS using the skills I freshly learned.<br /><br />",
      "Moreover, through my experience at LINCS I've learnt that I enjoy designing UIs and experimenting with how users react (UX) to my designs. This got me to also learn another technology, Figma, and some UI/UX design principles such as the rule of 4/8s, accessible design, basic principles of design (such as balance, proximity, color), etc.<br /><br />",
      "Building off of that, I've been able to develop some soft skills along my journey at LINCS. For one, I've defintely develop my ability to balace multiple tasks and responsabilities. Using scheduling tools and holding myself accountable, I've been able to keep track of current task progress and upcoming tasks, as well as giving myself the recognition that I'm completing these tasks and that I should feel proud of doing what I'm doing. Another skills has been developing my ability to maintain work-life balance. A work-hard play-hard motto was what I followed as I worked, where when it's 9-5, I'm focused on work, but never more and never less. This way I'm able to take the mental reset I'd need to keep myself fresh at work everyday, as well as simply doing the things I enjoy beyond work.<br /><br />",
      "<h3>My main project</h3>The main project I was handed was creating a dashboard to show key metrics that LINCS produces. It's meant to be a central hub of LINCS stats to show that the project is growing and progressing each and every day. Jumping into this, I didn't know what NextJS was and I've only heard of React. The closest thing that would have prepared me for this project was CIS*2750 where we learned JavaScript and how a full-stack application would be made. Anyways, I was given some resources to learn the framework and to start building the dashboard. I would begin with drawing out sketches of what I thought the dashboard should look like, as well as giving mock data to simulate API responses. I'd work with the UX team to improve user experience, and I'd work with stakeholders to discuss the actual contents of the dashboard. From there, I'd work with my manager to build the dashboard component by component, and eventually come to a fully working dashboard. Overall, it was a really rewarding experience - seeing something I've worked hard for coming to life - and I thoroughly enjoyed learning something new.<br /><br />",
      "<h3>Some shoutouts</h3>To sum up, I have nothing but gratitude and appreciation towards the folks at LINCS. They really took me in as their teammate as soon as I entered and I loved the culture they fostered. Although they're probably not reading this, I'd still like to give a big thanks to Pieter, Zach, Alliyya, Susan, and Amelia. Thank you Pieter, Zach, and Alliyya for being great mentors and providing wisdom as someone who's a professional in their field. My development over the summer is all because of them and I cannot thank them enough for it. Thank you Pieter for getting me started and guiding me through my first big project. Watching me learn NextJS and React from scratch must've made you cringe but you stuck by me a guided me to a successful end product. Thank you Susan for the wonderful opportunity. Our conversations have been nothing but delightful and I'm excited to see where the future of LINCS is headed. And thank you Amelia for being a great colleague and friend. Working with you made the job more exciting, and I grateful for your company.<br /><br />",
      "<h3>To wrap up</h3>Well that's my first work term finished. If this is the start, I'm excited to see where I go next.<br></br>"
    ]
  },
  {
    "title": "2/5 Co-ops down",
    "description": "Another co-op work term down! Tune in to see what a Full-Stack Developer position entails, life working at TAMVOES Health Inc, and some more second work term wisdom.",
    "author": "Richard Cui",
    "date": "01/07/2024",
    "photo": "/photos/blogs/2-lincsmap.png",
    "alt": "A map of services the LINCS Project offers",
    "thumbnail": "/photos/blogs/4-3/3-tamvoes.png",
    "banner": "/photos/blogs/16-9/3-tamvoes.png",
    "content": [
      "&emsp;&emsp;Well that’s 2 out of 5 co-op work terms completed and we’re half way through achieving the holy grail that is a Bachelor of Computing from the University of Guelph. The cherry on top as I pass approached the halfway point was marked through the completion of my second co-op work term with TAMVOES, a rising up-and-coming start-up creating a health management software to centralize and organize all health related domains into one easy-to-use platform. In this post, I’ll be discussing my role as a Full-Stack Developer at TAMVOES, the work culture in a start-up, and advice I have for students entering their first co-op work terms.<br /><br />",
      "<h3>What is TAVMOES?</h3>",
      "&emsp;&emsp;As mentioned before, TAMVOES is a health-management software used to centralize and organize all health related things such as providing singular platform to host all health documents, manage your dependencies and their records, search for professionals, journal and take notes, and much more. Beyond that however, it’s a platform for professionals to organize their staff and advertise their business; it allows admins to schedule and track shifts, assign staff to specific clients, edit and share documents with clients, and more. All of that is to say that TAMVOES is powerful and revolutionizes the way we approach operate our healthcare system. Beyond its purpose, TAMVOES is a female-led mother-daughter duo Jessica and Jordan Lunshof, attesting to their goal in creating a progressive and modernized platform for health management. They’re partnered and backed by many well known organizations such as the Ontario Bioscience Innovation Organization (OBIO), University of Waterloo, Mohawk College, Communitech, and many more. Ultimately, TAMVOES is a start-up looking to shake up the way we approach managing our health.<br /><br />",
      "%|/photos/blogs/16-9/3-workstation.png|<i>The workstation for each daily battle</i><br></br>",
      "<h3>What did I do?</h3>",
      "&emsp;&emsp;What does a Full-Stack Developer do (what you - the reader - is saying)? Well imagine if a Back-End Developer is a farmer for a burger restaurant and a Front-End Developer is the chef plating the burger to make it look nice. There is no burger with getting into the nitty-gritty and making the patty, but no one wants a burger that looks ugly and doesn’t taste good. Now imagine if the farmer and the chef was one position. Essentially that’s what a Full-Stack Developer is. You have full autonomy over your projects as you oversee all that’s happening, from the database to the UI.<br /><br />",
      "&emsp;&emsp;Starting with the database, TAMVOES uses a PostgreSQL (psql) database, something I’ve never used before. Luckily, my small experience using sqlite3 from CIS*2750 was enough to jumpstart my learning and allowed me to catch onto the syntax quite quickly. If you’re unfamiliar with query languages, it’s essentially like learning a broken English dialect. It may seem a little wacky at first but you just have to get used to the quirks and it’ll be second-hand soon. All of my tasks involving (psql) involved CRUD (Create, Read, Update, Delete) operations to maintain the database from program updates. Making any changes to the database (like creating/deleting tables) involved updating the schema-modification file to keep track of updates to the database. Testing involved using the psql command-line interface to use psql queries without committing any changes, as well as using the psql graphical user interface (GUI) to manually manipulate the database. Personally, using psql is something I find has an easy starting point, yet has a high ceiling in terms of mastering it. For me, that keeps it interesting as there’s always something I learn while using it. All in all, a super important skills to learn as a developer and it’s one that isn’t the hardest to get started with. I’d recommend starting with sqlite as it’s a file-based database so you don’t have to worry about starting a server and its semantics.<br></br>",
      "&emsp;&emsp;Diving into the API development, TAMVOES has 2 separate API servers hosted by two different frameworks. The one I worked on the most was using Pyramid on Python, used by the UI server; the other being ExpressJS through JavaScript, used by the external API server. Creating RestFUL API endpoints is something I was relatively new with when starting my position. The only experience I had with APIs were creating endpoints through NextJS but that was incredibly abstracted and I still had no idea what a PUT HTTP method is. Using Pyramid was something I’ve never used but was also a skill that was quite easy to pick up after some taking some time with it. Because I’m not a pioneer at TAMVOES, there were countless examples of other endpoints that I could refer to, as well as reading documentation and sending my manager a quick message asking for help that really boosted my learning within the framework and I quickly got ahold of it. Furthermore, when it came to testing my endpoints, that’s where Postman and Swagger API came to play. With Postman, I could send requests to my endpoint like how I would with cURL or using my browser. However, where Postman shine is its autonomy in how you send your requests. I could add bearer tokens to authenticated endpoints, I could send files to endpoints that take multipart form-data, I could change the HTTP method through a dropdown. Its pleasant UI made it easy to ensure that my endpoint works as intended. Swagger API had an interface to test endpoints, but mainly was used to document API endpoints for developers to familiarize themselves with. It’s essentially an API dictionary that tells you how an endpoint works. Ultimately, developing API was something that was little rocky since any small syntax error cause your once-existing endpoint to suddenly disappear, but because of the abundance of resources I had, it got easier the more I worked on tasks involving API development tasks.<br></br>",
      "&emsp;&emsp;As for the front-end, we used React. React was something I was already familiar with from my previous co-op term, so it was simply picking up from where I left off. Beneficially, the React website has great documentation and great step-by-step instructions in familiarizing yourself with the JavaScript library. However, because I’m familiar with React doesn’t mean I still didn’t learn new niches that React has; things such as StrictMode and more hook usage (like useRef, useMemo). The primary component library used with the UI repository was react-bootstrap, and the styling was mainly controlled by Bootstrap with some vanilla CSS sprinkled here and there for components needing a little more styling that Bootstrap can’t reach. Programming the UI went like clockwork and involved reading lots of documentation on existing libraries that were used.<br></br>",
      "&emsp;&emsp;Beyond programming, the big focus I had with most of my tasks was to execute the design process when developing new features. This involves creating personas, user flow diagrams, wireframes, and prototypes. This allowed me to take a deep dive into Figma. Learning how to use Figma was strictly through repetitive usage and YouTube tutorials. Ultimately, it got me to organize my thoughts and research when surveying users to create a prototype that I’d present to the company’s stakeholders to inquire feedback. This loop of research - prototype - feedback would happen until I get the green light to hit Visual Studio Code to start bringing my design to life. Personally, this was my favourite part of the job as I could use the creative side of my brain. Seeing mockups come to life is something I’ll always cherish and look forward to when tackling a full-stack task.<br></br>",
      "&emsp;&emsp;Lastly, the boring stuff. I personally found unit testing immensely boring. It’s quite repetitive and mundane, and there’s a lot of tests to create to make sure all areas of your components are tested. Although boring, I can’t stress the importance of unit testing - and testing in general. There have been so many times where I push some changes to a branch, forgetting to check if my changes caused a domino effect of other parts of the repository, possibly rendering other areas faulty. Unit tests allow us to push code with a little more confidence as there’s a first line of automated defence whenever any changes are made. The softwares I used were PyUnit and Jest for testing API endpoints and React components respectively. These softwares - and unit testing overall - was somewhat easy to pick up. I’ve never done unit testing before but there were so many existing examples where you could kind of just copy and paste old ones and tailor them however you want. I’m sure however, that there’s a big learning curve to really master testing (which is why the Quality Assurance role exists in the field). Overall, it was a boring part of the work but absolutely necessary, especially in an environment where collaboration on projects are prominent.<br></br>",
      "%|/photos/blogs/16-9/3-figma.png|<i>User flow diagram for a redesigned login page</i><br></br>",
      "<h3>How is it like working at TAMVOES?</h3>",
      "&emsp;&emsp;Firstly, the pace is definitely faster than my first co-op position. We worked in an agile environment where we’re assigned weekly tasks, daily standup meetings, and weekly dev meetings where my supervisor and I met with stakeholders. These weekly duties were called “sprints”, and essentially it meant “finish all your tasks before the start of the next sprint”. At the beginning, this sprint format had me shaking because it seemed like output and constant performance was all they asked for, and the question loomed over my head as to whether or not I can keep up. Additionally, weekly dev meetings with stakeholders had me quite nervous as it seemed as though if I didn’t perform, I’d throw the entire University of Guelph under the bus and that’s one less company looking to hire from here. However, as time past and my relationships with my supervisor and stakeholder grew, I grew more confident and comfortable in my position, and the weekly sprints didn’t seem as daunting anymore. My supervisor (shoutout Andrew) was super supportive and was always available to answer any questions I had regarding my tasks or anything tech related. He was also just a great guy to talk to - from my complaints as a Residence Assistant in Guelph to his weekly Thursday lunch grocery shopping trips - he made each working day quite enjoyable. The stakeholders (shoutout Jessica and Jordan) were also quite welcoming and supportive. Although our communication was limited to water cooler conversations in the office and our weekly standup meetings, they were always engaged with the content I had to present to them and always provided feedback towards my performance whether positive or constructive, allowing me to build on my strengths and weaknesses. All-in-all, their motto of “work hard play hard” is evident within the work culture they uphold. It’s quite inspiring and the motto is something I now try to implement in my studies and ambitions.<br></br>",
      "%|/photos/blogs/16-9/3-velocity.png|<i>University of Waterloo's Velocity building - Home hundreds of startups, including TAMVOES</i><br></br>",
      "<h3>Any advice?</h3>",
      "&emsp;&emsp;Co-ops are not worth overly stressing over. Adequate stress is good as it allows you to mobilize and take action. However, if it comes to a point where it’s all you can think about, you have to take a step back and take some time for yourself. Yes there’s job market this, and layoffs that, but if your happiness is achieved solely based off employment status, you’ll genuinely never be satisfied. Take some time to reflect on what can give you consistent pleasure - things like reading, exercising, building Legos - and allocate adequate time for that.<br></br>",
      "&emsp;&emsp;In terms of effort  but beyond that it becomes one of those “it is what it is” type of situations. You gave it your all but it didn’t work out, what more can you do? Bounce back and stay patient; your time will come. Keep putting in the work and great things will happen.<br></br>"
    ]
  }
]
